УТ.УчетЗадач/src/Documents/cbr_Задача/cbr_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>cbr_Задача</name>
  <comment>Задачи сотрудников</comment>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеЗадачи</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗадачи</name>
    <type>
      <types>CatalogRef.cbr_ВидыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.cbr_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЗадача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольВремени</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетКонтроляПоЗавершению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.cbr_МеткиЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>CatalogRef.cbr_ПричиныЗакрытияЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Наблюдатели</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>Текст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Выполнен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Метки</name>
    <attributes>
      <name>Метка</name>
      <type>
        <types>CatalogRef.cbr_МеткиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ.УчетЗадач/src/InformationRegisters/cbr_ИсполнителиЗадач/cbr_ИсполнителиЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>cbr_ИсполнителиЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.cbr_Роли</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.cbr_ГруппыДоступаКЗадачам</types>
    </type>
  </resources>
  <resources>
    <name>ЗадачаВзята</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>DocumentRef.cbr_Задача</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ.УчетЗадач/src/Enums/СпособыУстановкиВремениНапоминания/СпособыУстановкиВремениНапоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СпособыУстановкиВремениНапоминания</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Периодически</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтносительноТекущегоВремени</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВУказанноеВремя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОтносительноВремениПредмета</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ.УчетЗадач/src/Catalogs/cbr_ГруппыДоступаКЗадачам/cbr_ГруппыДоступаКЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>cbr_ГруппыДоступаКЗадачам</name>
  <attributes>
    <name>Руководитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ.УчетЗадач/src/Documents/cbr_Задача/Forms/ФормаОтклоненияЗадачи/Module.bsl
#Область ОбработчикиСобытийформы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрПостановщик = Неопределено;
	Если Параметры.Свойство("Постановщик", ПараметрПостановщик) Тогда
		Постановщик = ПараметрПостановщик;
	КонецЕсли;
	
	ПараметрГлавныйМенеджер = Неопределено;
	Если Параметры.Свойство("ГлавныйМенеджер", ПараметрГлавныйМенеджер) Тогда
		ГлавныйМенеджер = ПараметрГлавныйМенеджер;
	КонецЕсли;
	
	ПараметрОснование = Неопределено;
	Если Параметры.Свойство("Основание", ПараметрОснование) Тогда
		Основание = ПараметрОснование;
	КонецЕсли;
	
	ПараметрАвтор = Неопределено;
	Если Параметры.Свойство("Автор", ПараметрАвтор) Тогда
		Автор = ПараметрАвтор;
	КонецЕсли;
	
	ПараметрИсполнительЗадачи = Неопределено;
	Если Параметры.Свойство("Исполнитель", ПараметрИсполнительЗадачи) Тогда
		ИсполнительЗадачи = ПараметрИсполнительЗадачи;
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Отклонить(Команда)
	Если Не ЗначениеЗаполнено(ПричинаОтказа) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не введена причина отказа");
		Возврат;		
	КонецЕсли;
	ОтклонитьНаСервере();
	Закрыть();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ОтклонитьНаСервере()   	
	
	ГруппаЗадачи = ПолучениеГруппыЗадачи();
	
	Если ГруппаЗадачи = Неопределено И ТипЗнч(Постановщик) = Тип("СправочникСсылка.Пользователи") Тогда
		Исполнитель = Постановщик;
	ИначеЕсли ГруппаЗадачи <> Неопределено И ТипЗнч(ГруппаЗадачи.ПредыдущийИсполнитель) = Тип("СправочникСсылка.cbr_ГруппыДоступаКЗадачам") Тогда
		Исполнитель = ГруппаЗадачи.ПредыдущийИсполнитель;
	ИначеЕсли ГруппаЗадачи <> Неопределено И ТипЗнч(ГруппаЗадачи.ПредыдущийИсполнитель) = Тип("СправочникСсылка.Пользователи") И ТипЗнч(Постановщик) = Тип("СправочникСсылка.Пользователи") Тогда
		Исполнитель = Постановщик;
	Иначе
		Исполнитель = ГлавныйМенеджер;
	КонецЕсли;
	
	Менеджер = РегистрыСведений.cbr_ИсполнителиЗадач.СоздатьМенеджерЗаписи();
	Менеджер.Задача = Основание;
	Менеджер.Период = ТекущаяДатаСеанса();
	Менеджер.Исполнитель = Исполнитель;
	Менеджер.ПричинаОтказа = ПричинаОтказа;
	Менеджер.Записать();
		
	Если ГруппаЗадачи <> Неопределено И ГруппаЗадачи.Руководитель <> Неопределено Тогда
		Исполнитель = ГруппаЗадачи.Руководитель;
	КонецЕсли;
	
	УведомитьПользователя(Исполнитель);
	
КонецПроцедуры

&НаСервере
Функция ПолучениеГруппыЗадачи()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА cbr_ИсполнителиЗадачСрезПоследних.Исполнитель ССЫЛКА Справочник.cbr_ГруппыДоступаКЗадачам
	|			ТОГДА ВЫРАЗИТЬ(cbr_ИсполнителиЗадачСрезПоследних.Исполнитель КАК Справочник.cbr_ГруппыДоступаКЗадачам).Руководитель
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Руководитель,
	|	cbr_ИсполнителиЗадачСрезПоследних.Исполнитель КАК ПредыдущийИсполнитель
	|ИЗ
	|	РегистрСведений.cbr_ИсполнителиЗадач.СрезПоследних(
	|			,
	|			Задача = &Задача
	|				И  Исполнитель <> &Исполнитель ) КАК cbr_ИсполнителиЗадачСрезПоследних";

	Запрос.УстановитьПараметр("Задача", Основание);
	Запрос.УстановитьПараметр("Исполнитель", ИсполнительЗадачи);
	
	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Новый Структура("ПредыдущийИсполнитель,Руководитель", Выборка.ПредыдущийИсполнитель, Выборка.Руководитель);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
Процедура УведомитьПользователя(Исполнитель)
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекстПричиныОтказа = "Назначенный исполнитель отказался от задачи. Причина: " + ПричинаОтказа;
	ПериодичностьНапоминания = ПредопределенноеЗначение(
		"Перечисление.СпособыУстановкиВремениНапоминания.Периодически");
	
	СвойстваУведомления = Новый Структура;
	СвойстваУведомления.Вставить("Пользователь", Исполнитель);
	СвойстваУведомления.Вставить("Описание", ТекстПричиныОтказа);
	СвойстваУведомления.Вставить("СрокНапоминания", ТекущаяДата);
	СвойстваУведомления.Вставить("ВремяСобытия", ТекущаяДата);
	СвойстваУведомления.Вставить("СпособУстановкиВремениНапоминания", ПериодичностьНапоминания);
	СвойстваУведомления.Вставить("ИнтервалВремениНапоминания", 60);
	СвойстваУведомления.Вставить("Источник", Основание);
	СвойстваУведомления.Вставить("Идентификатор", "");
	
	ПринудительныеУведомления = Новый Структура;
	ПринудительныеУведомления.Вставить("База", Истина);
	ПринудительныеУведомления.Вставить("Битрикс", Ложь);
	ПринудительныеУведомления.Вставить("Телеграм", Ложь);
	ПринудительныеУведомления.Вставить("ЭлектроннаяПочта", Ложь);
	
	cbr_УведомленияПользователей.ОтправитьУведомлениеПользователю(СвойстваУведомления,
		ПринудительныеУведомления);
КонецПроцедуры
#КонецОбласти
